//二级指针
int twolevlepointer()
{
	int a = 100;
	int *p1 = &a;
	//二级指针有两个**
	int **p2 = &p1;//指针变量也是一种变量，也会占用存储空间，也可以使用&获取它的地址

	//p2(&p1)->p1(&a)->a(100)

	//三级四级指针
	int ***p3 = &p2;
	int ****p4 = &p3;


	//想要获取指针指向的数据时，一级指针加一个*，二级指针加两个*，三级指针加三个*，以此类推，请看代码：

	printf("a=%d,*p1=%d,*p2=%d,*p3=%d\n",a,*p1,**p2,***p3);
	printf("&p2=%#x,&p3=%#x\n", &p2, &p3);
	printf("&p1 = %#X, p2 = %#X, *p3 = %#X\n", &p1, p2, *p3);
	printf(" &a = %#X, p1 = %#X, *p2 = %#X, **p3 = %#X\n", &a, p1, *p2, **p3);
	return 0;

}

