#include<stdio.h>
#include<stdlib.h>

void Swap(int *p1, int *p2)
{
	if (*p1 != *p2) {
		*p1 = *p1 ^ *p2;
		*p2 = *p1 ^ *p2;
		*p1 = *p1 ^ *p2;
	}
}

int SignReversal(int a)
{
	return ~a + 1;
}


int my_abs(int a)
{
	int i = a >> 31;
	return i == 0 ? a : (~a + 1);
}

void binDis(int data) {
	int i = 32;
	while (i--)
	{
		if (data & (1 << i)) {
			printf("1");
		}
		else {
			printf("0");
		}

		if (i % 8 == 0) {
			printf(" ");
		}
	}
	printf("\n");
}
/*
判断是否偶数
只要根据最未位是0还是1来决定，为0就是偶数，为1就是奇数。因此可以用if ((a & 1) == 0)代替if (a % 2 == 0)来判断a是不是偶数。
1 0000 0001
2 0000 0010
3 0000 0011
4 0000 0100
5 0000 0101
-----&都为1时为1---------
& 0000 0001
*/
void isEven() {
	for (int i = 0; i < 100; i++) {
		if (i & 1) {
			printf("i = %d\n", i);
		}
	}
}

/*
-128 1000 0001

-2   1111 1110
-    1000 0001
==============
		 1111 1101 反码
		 1000 0010 原码
-1   1111 1111 补码 (反码+1)
		 1111 1110 反码 -1
		 1000 0001 原码 1变0 0变1 符号位不变

-20  1000 0000 0001 0100 原码
		 1111 1111 1110 1011 反码
		 1111 1111 1110 1100 补码

2的幂表(n=1-200)2幂表
2^n   (n=1~500)

2^1=2
2^2=4
2^3=8
2^4=16
2^5=32
2^6=64
2^7=128
2^8=256

2的幂次方
1    0000 0001
2    0000 0010
4    0000 0100
8    0000 1000
16   0001 0000
32   0010 0000
64   0100 0000
128  1000 0000
如果n是2的幂数的话，那么n的二进制形式中只能有一个1存在，而 n-1 则有2的对数个连续的 1；
所以，判断一个数是否是2的幂数的代码如下：

*/

void isPoverOfTwo() {
	for (int i = 2; i < 70; i++) {
		/*
		& 两个位都为1时，结果才为1 ，当 i =2时
		
		2    0000 0010 
		1    0000 0001 &
		-----------------
				 0000 0000	
		3    0000 0011 i=3  
		2    0000 0010 &
		-----------------
				 0000 0010 所以3不是

		3    0000 0011 i=4
		4    0000 0100 &
		-----------------
				 0000 0000	

		*/
		if ((i & (i - 1))==0) { //等于0 就是2幂数
			printf("i = %d\n", i);
		}
	}
}

int main() {
	
	/*int a = -15, b = 15;
	printf("%d %d\n", a >> 2, b >> 2);

	

	char *s1 = "Hello";
	char *s2 = "World";
	printf("%s %s\n", s1, s2);
	Swap(&s1, &s2);
	printf("%s %s\n", s1, s2);


	int aa = 7, bb = -12345;
	printf("%d  %d\n", SignReversal(aa), SignReversal(bb));

	printf("%d\n", my_abs(5));


	int xx = 0xff;
	binDis(xx);
	xx = xx << 8;
	binDis(xx);*/

	isPoverOfTwo();

	system("pause");
	return 0;
}