#include<stdio.h>
#include<stdlib.h>
#include<limits.h>
int main计算机补码原理() {
	
	/*
	https://zh.wikipedia.org/wiki/Limits.h limits.h是C标准函数库中的头文件，定义了整数类型的一些极限值。
	INT_MIN		整型最小值：			-2147483648	，即 -(2^31)
	INT_MAX		整型最大值：			+2147483647 ，即2^31 - 1
	UINT_MAX  无符号整型最大值： 4294967295 ，即2^32 - 1
	*/
	/*
	%d 整数的参数会被转成一有符号的十进制数字
	%u 整数的参数会被转成一无符号的十进制数字
	*/

	//int的上限 下限
	printf("INT_MAX=%d \t %u \n", INT_MAX, INT_MAX);  // 2147483647
	printf("INT_MIN=%d \t %u \n", INT_MIN, INT_MIN);  //-2147483648

	/*
	4294967295 32位内存存储形式
	1111 1111 1111 1111 1111 1111 1111 1111    无符号，没有符号位，全部都是数据 4294967295

	0000 0000 0000 0000 0000 0000 0000 0001		 1的原码  最高位0代表正数 数据31个

	1000 0000 0000 0000 0000 0000 0000 0001		-1的原码  最高位1代表负数
	1111 1111 1111 1111 1111 1111 1111 1110		-1的反码  符号位不变，数值位0变1，1变0
	1111 1111 1111 1111 1111 1111 1111 1111   -1的补码  反码+1

	*/
	printf("UINT_MAX=%u\n", UINT_MAX);  //4294967295

	int x = 2147483648;
	int y = -1;
	printf("%d，%u\n", x, x); // -1  4294967295

	/*
	为什么	int x = 4294967295; 那么4294967295在计算机中的补码是 1111 1111 1111 1111 1111 1111 1111 1111
	%d接受的范围是INT_MAX或INT_MIN,是有符号位的，那么1111 1111 1111 1111 1111 1111 1111 1111 就是 -1的补码
	所以用输出为-1
	*/

	unsigned int num = -1; // 1111 1111 1111 1111 1111 1111 1111 1111 内存的存储方式
	printf("%d,  %u\n", num, num); // %u 0-正整数

	system("pause");
	return 0;
}